blog/2022/tech-thought-1.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 20:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>技术遐想（一）</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">技术遐想（一）</h1>
</header><p>
从昨天开始，就决定手写一个 Cheatsheet 网站，仿照 <a href="https://overapi.com/">OverAPI</a>。起因是想找到一个页面，能够看到 JS 相关所有理论知识，一搜索就找到了它，很喜欢这种样式。于是仿写的想法就产生了。
</p>

<p>
有三点需要记录下来：
</p>

<p>
一、怎样形成适合自己的解决问题的方法论？
</p>

<p>
最重要的一点：知道自己想要什么。比如说，我想知道怎样用 CSS 画一个正方形，我就会搜索“CSS square”，搜索结果就是答案。再比如，我想知道 JavaScript 的基础概念都有哪些，我试过直接搜索“JS basic concepts”，结果的确有哪些基础念，但这可能并非我真正需要的。
</p>

<p>
我在解决问题的时候，并没有对问题的本质进行思考。就用上一段的两个例子来说，前者很明确，就是想用 CSS 画个正方形；后者却不那么具体，“基础概念”一词，每个人的理解都不一样，所以我找到的答案都是 <b>别人认为的基础概念</b> 。刚开始学习一门语言的时候，我不知道哪些是基础概念，哪些只是需要了解，这个时候了解已经掌握这门语言的人，他们是怎样学习的，就很重要。之后再思考：掌握一门语言的关键在哪里（数据类型，函数）。
</p>

<p>
遇到问题，怎样进行分析？
</p>

<ol class="org-ol">
<li>你要知道，这个问题是否真的是个问题。因为有时，我们会误以为这是个很困难的问题，直到解决了那一刻才意识到，原来这么容易就能解决。为什么我们没有在最开始就想到这一点？可能的原因就是，没有对问题的本质进行探讨。还是上文想知道 JS 基本概念的例子，其实我并不只是想知道 JS 的基本概念，我还想了解语言的整体，我要知道它有哪些部分构成，分别都起什么作用。这就是在 What 层面上的思考，即它是否是一个问题。</li>
<li>How 层面。这个问题是怎样产生的？代码层面，能不能做一个最小 demo 把问题复现。</li>
<li>Why 层面。问题出现了，为什么会在这里出现这样的问题，是否了解了足够多的背景信息？官方文档是否逐字句阅读过？</li>
<li>还有其他需要思考之处：在解决问题的过程中，你能查阅哪些资料，我知道的有 MDN，GitHub，搜索引擎；你有没有找到更好的解决办法；为了不让自己重复解决相同或类似的问题，写成博客或是记笔记就是一个好办法；通过这次问题，学习到了哪些东西。</li>
</ol>

<p>
致谢：
</p>

<ol class="org-ol">
<li><a href="https://github.com/lencx/z/discussions/79">解决问题方法论</a></li>
<li><a href="https://program-think.blogspot.com/2009/02/study-technology-in-three-steps.html">学习技术的三部曲：WHAT、HOW、WHY</a></li>
</ol>

<p>
二、给定一个颜色数组，如何让它和网页中的目标元素一一对应
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">rgbas</span> = [
  <span style="color: #ddbc91;">"rgba(251,34,240,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(214,17,21,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(14,251,252,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(158,134,255,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(60,255,20,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(44,158,52,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(225,211,20,0.25)"</span>,
  <span style="color: #ddbc91;">"rgba(100,117,121,0.25)"</span>,
];
<span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">boards</span> = document.getElementsByClassName(<span style="color: #ddbc91;">"board"</span>);

rgbas.forEach(() =&gt; {
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; boards.length; i++) {
    boards[i].style.backgroundColor = rgbas[i];
  }
})
</pre>
</div>

<ul class="org-ul">
<li>定义了颜色数组 rgbas[8]</li>
<li>将第一个颜色分配给第一个 board 元素；第二个颜色分配给第二个 board 元素；以此类推</li>
</ul>

<p>
下面赋值的部分还有另一种写法：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; rgbas.length; i++) {
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">j</span> = 0; j &lt; boards.length; j++) {
    ...
  }
}
</pre>
</div>

<p>
最开始想出的代码是这个样子：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">j</span> = 0; j &lt; rgbas.length; j++) {
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; boards.length; i++) {
    boards[i].style.backgroundColor = rgbas[j];
  }
}
</pre>
</div>

<p>
想实现上述效果，但却发现：每一个 board 都有相同的背景色，思考一会儿才发现，如果这样写就会把颜色数组 rgbas 的最后一个颜色元素赋值给每一个 board。
</p>

<p>
致谢：<a href="https://50projects50days.com/js/main.js">main.js</a>
</p>

<p>
三、怎样在多个页面应用相同的 HTML
</p>

<p>
我接触到一个概念——Web Components。在制作网站时，在很多页面都会共用同一个 header 和 footer，Web Components 就是帮助我们复用这些共同代码的。
</p>

<p>
<code>index.html</code> ：
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #91a0b3;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #a9df90;">html</span>&gt;
  &lt;<span style="color: #a9df90;">head</span>&gt;
    ...
    &lt;<span style="color: #a9df90;">script</span> <span style="color: #aaca86;">src</span>=<span style="color: #ddbc91;">"./components/header.js"</span> defer&gt;&lt;/<span style="color: #a9df90;">script</span>&gt;
  &lt;/<span style="color: #a9df90;">head</span>&gt;
  &lt;<span style="color: #a9df90;">body</span>&gt;
    &lt;<span style="color: #a9df90;">header-component</span>&gt;&lt;/<span style="color: #a9df90;">header-component</span>&gt;
  &lt;/<span style="color: #a9df90;">body</span>&gt;
&lt;/<span style="color: #a9df90;">html</span>&gt;
</pre>
</div>

<p>
<code>./components/header.js</code> ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">headerTemplate</span> = document.createElement(<span style="color: #ddbc91;">"template"</span>);

headerTemplate.innerHTML = <span style="color: #ddbc91;">`</span>
<span style="color: #ddbc91;">  &lt;style&gt;</span>
<span style="color: #ddbc91;">    header {</span>
<span style="color: #ddbc91;">      background: rgba(0, 0, 0, 0.6);</span>
<span style="color: #ddbc91;">      color: #999;</span>
<span style="color: #ddbc91;">      width: 100%;</span>
<span style="color: #ddbc91;">      z-index: 2;</span>
<span style="color: #ddbc91;">      display: flex;</span>
<span style="color: #ddbc91;">    }</span>

<span style="color: #ddbc91;">    header a {</span>
<span style="color: #ddbc91;">      text-decoration: none;</span>
<span style="color: #ddbc91;">      color: #fff;</span>
<span style="color: #ddbc91;">      outline: none;</span>
<span style="color: #ddbc91;">    }</span>
<span style="color: #ddbc91;">    header a:visited {</span>
<span style="color: #ddbc91;">      color: #999;</span>
<span style="color: #ddbc91;">    }</span>
<span style="color: #ddbc91;">    header a:hover {</span>
<span style="color: #ddbc91;">      color: #fff;</span>
<span style="color: #ddbc91;">    }</span>

<span style="color: #ddbc91;">    header a#logo {</span>
<span style="color: #ddbc91;">      color: #fff;</span>
<span style="color: #ddbc91;">      font-size: 18px;</span>
<span style="color: #ddbc91;">      font-weight: bold;</span>
<span style="color: #ddbc91;">      margin: 0;</span>
<span style="color: #ddbc91;">      padding: 15px;</span>
<span style="color: #ddbc91;">      text-align: center;</span>
<span style="color: #ddbc91;">    }</span>

<span style="color: #ddbc91;">    header ul {</span>
<span style="color: #ddbc91;">      display: flex;</span>

<span style="color: #ddbc91;">    }</span>
<span style="color: #ddbc91;">    ul li {</span>
<span style="color: #ddbc91;">      margin-right: 5px;</span>
<span style="color: #ddbc91;">      padding: 0 5px;</span>
<span style="color: #ddbc91;">      list-style-type: none;</span>
<span style="color: #ddbc91;">    }</span>
<span style="color: #ddbc91;">    ul li a {</span>
<span style="color: #ddbc91;">      display: block;</span>
<span style="color: #ddbc91;">    }</span>
<span style="color: #ddbc91;">  &lt;/style&gt;</span>
<span style="color: #ddbc91;">  &lt;header&gt;</span>
<span style="color: #ddbc91;">    &lt;a href="/" id="logo"&gt;Home&lt;/a&gt;</span>
<span style="color: #ddbc91;">    &lt;ul&gt;</span>
<span style="color: #ddbc91;">      &lt;li&gt;&lt;a href="javascript.html"&gt;JavaScript&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #ddbc91;">      &lt;li&gt;&lt;a href="css.html"&gt;CSS&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #ddbc91;">      &lt;li&gt;&lt;a href="html.html"&gt;HTML&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #ddbc91;">      &lt;li&gt;&lt;a href="developer-tools.html"&gt;Developer Tools&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #ddbc91;">    &lt;/ul&gt;</span>
<span style="color: #ddbc91;">  &lt;/header&gt;</span>
<span style="color: #ddbc91;">`</span>;

<span style="color: #91a0b3;">class</span> Header <span style="color: #91a0b3;">extends</span> HTMLElement {
  constructor() {
    <span style="color: #91a0b3;">super</span>();
  }

  connectedCallback() {
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">shadowRoot</span> = <span style="color: #ab85a3;">this</span>.attachShadow({ mode: <span style="color: #ddbc91;">"closed"</span> });

    shadowRoot.appendChild(headerTemplate.content);
  }
}

customElements.define(<span style="color: #ddbc91;">"header-component"</span>, Header);
</pre>
</div>

<p>
实现一个 Web Component 的一般步骤：
</p>

<ol class="org-ol">
<li>对现有 Class 的功能进行扩展，创建自己的 Class</li>
<li>使用 CustomElementRegistry.define() 方法注册你的自定义标签</li>
<li>如果需要，附加 shadow DOM 到自定义元素中</li>
<li>如果需要，使用 &lt;template&gt; 和 &lt;slot&gt; 定义 HTML 模板。再一次使用常规 DOM 方法克隆模板，并把它附加在你的 shadow DOM 下</li>
<li>你可以在任何你需要的页面使用你的自定义标签</li>
</ol>

<p>
致谢：
</p>

<ol class="org-ol">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">Web Components - MDN</a></li>
<li><a href="https://www.freecodecamp.org/news/reusable-html-components-how-to-reuse-a-header-and-footer-on-a-website/">Reusable HTML Components – How to Reuse a Header and Footer on a Website</a></li>
</ol>
</div>
</body>
</html>